; domain
(define (domain STRIPS_domain)
  (:requirements :strips)
  (:predicates
    (on ?x ?y)
    (clear ?x)
    (holding ?x)
    (ontable ?x)
    (handempty)
  )
(:action pick-up
    :parameters (?x)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (not (ontable ?x))
                 (not (clear ?x))
                 (not (handempty))
                 (holding ?x)))


(:action put-down
    :parameters (?x)
    :precondition (holding ?x)
    :effect (and (not (holding ?x))
                 (clear ?x)
                 (handempty)
                 (ontable ?x)))


(:action stack
    :parameters (?x ?y)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (not (holding ?x))
                 (not (clear ?y))
                 (clear ?x)
                 (handempty)
                 (on ?x ?y)))


(:action unstack
    :parameters (?x ?y)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and (holding ?x)
                 (clear ?y)
                 (not (clear ?x))
                 (not (handempty))
                 (not (on ?x ?y))))

)

; problem
(define 
(problem BLOCKS-4)
(:domain STRIPS_domain)
(:objects WASHER NUT NAIL BOLT)
(:init (HANDEMPTY)
(CLEAR BOLT)
(ONTABLE NAIL)
(ON BOLT WASHER)
(ON WASHER NUT)
(ON NUT NAIL)
)
(:goal (and (HANDEMPTY)
(CLEAR NUT)
(ONTABLE NAIL)
(ON NUT WASHER)
(ON WASHER BOLT)
(ON BOLT NAIL)
))
)

; plan
1. (unstack bolt washer)
   deleted: (clear bolt) (handempty) (on bolt washer)
   added: (holding bolt) (clear washer)
   goals met: 1 of 6
2. (put-down bolt)
   deleted: (holding bolt)
   added: (clear bolt) (handempty) (ontable bolt)
   goals met: 2 of 6
3. (unstack washer nut)
   deleted: (clear washer) (handempty) (on washer nut)
   added: (holding washer) (clear nut)
   goals met: 2 of 6
4. (put-down washer)
   deleted: (holding washer)
   added: (clear washer) (handempty) (ontable washer)
   goals met: 3 of 6
5. (unstack nut nail)
   deleted: (clear nut) (handempty) (on nut nail)
   added: (holding nut) (clear nail)
   goals met: 1 of 6
6. (put-down nut)
   deleted: (holding nut)
   added: (clear nut) (handempty) (ontable nut)
   goals met: 3 of 6
7. (pick-up bolt)
   deleted: (ontable bolt) (clear bolt) (handempty)
   added: (holding bolt)
   goals met: 2 of 6
8. (stack bolt nail)
   deleted: (holding bolt) (clear nail)
   added: (clear bolt) (handempty) (on bolt nail)
   goals met: 4 of 6
9. (pick-up washer)
   deleted: (ontable washer) (clear washer) (handempty)
   added: (holding washer)
   goals met: 3 of 6
10. (stack washer bolt)
   deleted: (holding washer) (clear bolt)
   added: (clear washer) (handempty) (on washer bolt)
   goals met: 5 of 6
11. (pick-up nut)
   deleted: (ontable nut) (clear nut) (handempty)
   added: (holding nut)
   goals met: 3 of 6
12. (stack nut washer)
   deleted: (holding nut) (clear washer)
   added: (clear nut) (handempty) (on nut washer)
   goals met: 6 of 6
